/*
Copyright (c) 2011 Simon Fell

Permission is hereby granted, free of charge, to any person obtaining a 
copy of this software and associated documentation files (the "Software"), 
to deal in the Software without restriction, including without limitation
the rights to use, copy, modify, merge, publish, distribute, sublicense, 
and/or sell copies of the Software, and to permit persons to whom the 
Software is furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included 
in all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS 
OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, 
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE 
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER 
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, 
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN 
THE SOFTWARE.
*/

"MDUpdateTo1072_Line1" = "The OSX 10.7.2 update includes important bug fixes related to applescript access to attachments in Mail, these fixes are required for Maildrop to work correctly.";
"MDUpdateTo1072_Line2" = "It is highly recommended that you update your system to 10.7.2 or later.";
"MDUpdateTo1072_Line3" = "If you do not wish to upgrade right now, then you can as a work around disable support for attachments.";

"MDEnableAttachments_Line1" = "The OSX 10.7.2 update included fixes for attachments in Mail, do you want to re-enable attachment support now ?";

"MDEnableAttachmentsButton" = "Enable Attachments";
"MDDisableAttachmentsButton" = "Disable Attachments";
